{
  "pageTextData": [
    {
      "title": "Coca Cola Great Britain",
      "subTitle": "Founded in 1886 Dr John S Pemberton",
      "description": "The Coca Cola Company is the world's leading manufacturer, marketer and distributor of non-alcoholic beverage concentrates and syrups, and produces nearly 400 brands."
    },
    {
      "title": "Coca Cola",
      "subTitle": "New York Harbour, 1886",
      "description": "It was 1886, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special!"
    },
    {
      "title": "Sprite",
      "subTitle": "West Germany, 1959",
      "description": "First introduced in 1961, crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of our no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
    },
    {
      "title": "Dr Pepper",
      "subTitle": "Texas, 1885",
      "description": "Dr Pepper's unique, sparkling blend of 23 fruit flavours has been around for well over a century and it's still the same, with that distinctive flavour you just can't quite put your tongue on. It was created by Texas pharmacist Charles Alderton in 1885. The distinctive, bold taste of Dr Pepper has been popular ever since."
    },
    {
      "x3dModelTitle": "Coca Cola X3D Model",
      "x3dCreationMethod": "This X3D model of the Coke Can has been created in Maxon Cinema 4D exported to VRML2.0 and converted, using the instant reality transcoders, to X3D for display online.",
      "title": "History of Coca Cola",
      "subTitle": "Atlanta Beginnings",
      "description": "It was 1886, and in New York Harbour, workers were constructing the Statue of Liberty. Eight hundred miles away, another great American symbol was about to be unveiled. Like many people who change history, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, he carried it a few doors down to Jacobs' Pharmacy. Here, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special. So Jacobs' Pharmacy put it on sale for five cents (about 3p) a glass."
    },
    {
      "x3dModelTitle": "Sprite X3D Model",
      "x3dCreationMethod": "This X3D model of the Sprite Bottle has been created in Maxon Cinema 4D exported to VRML2.0 and converted, using the instant reality transcoders, to X3D for display online.",
      "title": "Sprite - Fanta Klare Zitrone",
      "subTitle": "First introduced in 1961",
      "description": "Crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of Coca Cola's no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
    },
    {
      "x3dModelTitle": "Dr Pepper X3D Model",
      "x3dCreationMethod": "This X3D model of the Dr Pepper Cup has been created in Maxon Cinema 4D exported to VRML2.0 and converted, using the instant reality transcoders, to X3D for display online.",
      "title": "Dr Pepper - Liquid Sunshine",
      "subTitle": "23 fruit flavours",
      "description": "Dr Pepper's unique, sparkling blend of 23 fruit flavours has been around for well over a century and it's still the same, with that distinctive flavour you just can't quite put your tongue on. It was created by Texas pharmacist Charles Alderton in 1885. He gave a sample of the first ever batch to Wade Morrison, a local shop owner, and Mr Morrison instantly agreed to stock the drink. The distinctive, bold taste of Dr Pepper has been popular ever since."
    },
    {
      "galleryTitle": "Rendered 3D Images",
      "galleryDescription": "3D images rendered in Maxon Cinema4D with Hardware Renderer,<br>Composited in Adobe Photoshop CC"
    },
    {
      "CameraTitle": "Camera Views",
      "CameraSubtitle": "These buttons select a range of X3D model viewpoints"
    },
    {
      "AboutHead": "Statement of Originality",
      "AboutText": "These web pages are submitted as part requirements for the degree of Computing with Digital Media MSc at the University of Sussex.<br>They are the product of my own labour except where indicated in the web page content.<br>These web pages or contents may be freely copied and distributed provided the source is acknowledged.<br><br>These Web application is done as a Module assignment<br>part of 920G5 Mobile 3D Applications (Spring Semester 21/22)<br><br>By Chawit Chiwarattanaphan<br>Candidate number: 244152<br>Email: cc841@sussex.ac.uk",
      "AboutUnderstandHead": "Points of Deep Understanding<br>",
      "AboutUnderstandText": "(1) Models were made in Maxon Cinema4D<br>with texture using UV projection method (Coke can)<br>or texture baking (Sprite bottle & Dr Pepper cup)<br><br>(2) Models were exported from Maxon Cinema4D's format (.c4d) exported to VRML2.0 (.wrc)<br>then were coverted to X3D/X3DOM (.x3d) with Instant Reality Transcoders<br>Headlights, rotation animation, and camera were hard coded to .x3d after the fact, since compatability from C4D was limited<br><br>(3) 3D Renders were done in Maxon Cinema4D using Hardware Renderer, 6 Renders were made<br><br>(4) Version control were done with GitHub, with commit to main branch on every significant actions<br>https://github.com/ChawitC/M3DA/commits/main<br>",
      "AboutRefHead": "References",
      "AboutRefText1": "(1) University of Sussex's 920G5: Mobile 3D Applications' module materials, lab notes, lab tutorials and example codes by Professor Martin White.<br><br>(2) Maxon Cinema4D and X3D/X3DOM References<br>(2.1) Bottle Modelling ",
      "AboutRefText2": "(2.2) X3DOM Model Interactivity (Cameras, Lighting, Render Modes, Animation):<br>Largely adapted from the module's examples (coke.x3d) code by Professor Martin White.<br><br>(3) HTML/CSS References<br>(3.1) Bootstrap Buttons ",
      "AboutRefText3": "(3.2) Bootstrap Carousel ",
      "AboutRefText4": "(3.3) CSS Media Queries ",
      "AboutRefText5": "(4) Javascript References<br>(4.1) getElementbyId() ",
      "AboutRefText6": "(4.2) getElementsbyClassName() "
    },
    {
      "cokeRender1Addr": "assets/images/gallery_images/Coke1comp.png",
      "cokeRender2Addr": "assets/images/gallery_images/Coke1.png",
      "spriteRender1Addr": "assets/images/gallery_images/Sprite1.png",
      "spriteRender2Addr": "assets/images/gallery_images/Sprite2comp.png",
      "pepperRender1Addr": "assets/images/gallery_images/Pepper1.png",
      "pepperRender2Addr": "assets/images/gallery_images/Pepper2comp.png"
    },
    {
      "siteImg1Addr": "assets/images/site_images/coca_cola.jpg",
      "siteImg2Addr": "assets/images/site_images/sprite.jpg",
      "siteImg3Addr": "assets/images/site_images/dr_pepper.jpg",
      "siteImgBannerAddr": "background-image: url('assets/images/site_images/main_new.jpg');",
      "siteCarou1Addr": "assets/images/site_images/carou_coke.png",
      "siteCarou2Addr": "assets/images/site_images/carou_sprite.png",
      "siteCarou3Addr": "assets/images/site_images/carou_pepper.png"
    },
    {
      "textCarou1": "Coca Cola : Original Taste",
      "textCarou2": "Sprite : Chill Time is Not a Waste of Time",
      "textCarou3": "Dr Pepper : So Odd, So Good, So Misunderstood"
    }
  ]
}